[
    {
        "title": "Season 1 – Sunny",
        "score": "88%",
        "synopsis": "Living in Kyoto, Japan, Suzie's life is turned upside down after her husband and son disappear in a mysterious plane crash; as consolation, she receives Sunny, a domestic robot made by her husband's electronics company.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 1 – Sausage Party: Foodtopia",
        "score": "50%",
        "synopsis": "After killing all of humanity, Frank, Brenda, Barry, and Sammy attempt to build their very own food community.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 3 – Vikings: Valhalla",
        "score": "",
        "synopsis": "The adventures of famous Vikings as they blaze new paths in an ever-changing Europe.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 1 – Mastermind: To Think Like a Killer",
        "score": "",
        "synopsis": "A new perspective on the woman whose crime-hunting innovations changed history; to stop serial killers, Dr. Ann Burgess must first learn to think like one; Burgess investigates and studies the damaged psyches of victims and their attackers.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 2 – The Serpent Queen",
        "score": "",
        "synopsis": "\"The Serpent Queen\" is a cunning account of one of the most influential women ever to wear a crown: Catherine de' Medici. Considered an immigrant, common and plain, de' Medici marries into the 16th century French court as an orphanedteenager, expected to bring a fortune in dowry and produce many heirs. She quickly discovers that her husband is in love with an older woman, her dowry is unpaid, and she is unable to conceive. Yet, with only her intelligence and determination, she manages to keep her marriage alive and masters the bloodsport that is the monarchy better than anyone else, ruling France for 50 years.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 1 – Me",
        "score": "",
        "synopsis": "New school, new family, new superpower; a season of change for 12-year-old Ben Vasani when he discovers that he can transform into anyone he meets; as a shapeshifter, Ben must figure out who he is and who he wants to be.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 21 – The Bachelorette",
        "score": "",
        "synopsis": "A woman meets a number of men and tries to narrow them down to one who could steal her heart.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 3 – All American: Homecoming",
        "score": "",
        "synopsis": "A young adult sports drama set against the backdrop of the HBCU, aka historically Black colleges and universities, experience at Bringston University, where Black excellence is a way of life. The series follows Simone, a young tennis hopeful from Beverly Hills who is trying to fight her way back after some time away from the court; Damon, an elite baseball player from Chicago who is carrying the weight of the world on his shoulders; JR, Damon's fellow baseball player and childhood friend; Thea, the super-competitive queen bee of the Bringston tennis team; and Keisha, the school's unofficial mayor who must help Simone learn how to live her best life. As they contend with the high stakes of college sports, Simone and Damon must also navigate the highs and lows of unsupervised early adulthood at a prestigious HBCU.\n            \nRead More\nRead Less"
    },
    {
        "title": "The Bikeriders",
        "score": "81%",
        "synopsis": "THE BIKERIDERS captures a rebellious time in America when the culture and people were changing. After a chance encounter at a local bar, strong-willed Kathy (Jodie Comer) is inextricably drawn to Benny (Austin Butler), the newest member of Midwestern motorcycle club, the Vandals led by the enigmatic Johnny (Tom Hardy). Much like the country around it, the club begins to evolve, transforming from a gathering place for local outsiders into a dangerous underworld of violence, forcing Benny to choose between Kathy and his loyalty to the club.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 1 – Star Wars: The Acolyte",
        "score": "80%",
        "synopsis": "A former Padawan reunites with her Jedi Master to investigate a series of crimes but discovers the forces they confront are more sinister than they ever anticipated.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 3 – All American: Homecoming",
        "score": "",
        "synopsis": "A young adult sports drama set against the backdrop of the HBCU, aka historically Black colleges and universities, experience at Bringston University, where Black excellence is a way of life. The series follows Simone, a young tennis hopeful from Beverly Hills who is trying to fight her way back after some time away from the court; Damon, an elite baseball player from Chicago who is carrying the weight of the world on his shoulders; JR, Damon's fellow baseball player and childhood friend; Thea, the super-competitive queen bee of the Bringston tennis team; and Keisha, the school's unofficial mayor who must help Simone learn how to live her best life. As they contend with the high stakes of college sports, Simone and Damon must also navigate the highs and lows of unsupervised early adulthood at a prestigious HBCU.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 3 – All American: Homecoming",
        "score": "",
        "synopsis": "A young adult sports drama set against the backdrop of the HBCU, aka historically Black colleges and universities, experience at Bringston University, where Black excellence is a way of life. The series follows Simone, a young tennis hopeful from Beverly Hills who is trying to fight her way back after some time away from the court; Damon, an elite baseball player from Chicago who is carrying the weight of the world on his shoulders; JR, Damon's fellow baseball player and childhood friend; Thea, the super-competitive queen bee of the Bringston tennis team; and Keisha, the school's unofficial mayor who must help Simone learn how to live her best life. As they contend with the high stakes of college sports, Simone and Damon must also navigate the highs and lows of unsupervised early adulthood at a prestigious HBCU.\n            \nRead More\nRead Less"
    }
]