[
    {
        "title": "Season 1 – Sunny",
        "season": "1",
        "series": "Sunny",
        "score": "88%",
        "synopsis": "Living in Kyoto, Japan, Suzie's life is turned upside down after her husband and son disappear in a mysterious plane crash; as consolation, she receives Sunny, a domestic robot made by her husband's electronics company.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 1 – Sausage Party: Foodtopia",
        "season": "1",
        "series": "Sausage Party: Foodtopia",
        "score": "50%",
        "synopsis": "After killing all of humanity, Frank, Brenda, Barry, and Sammy attempt to build their very own food community.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 3 – Vikings: Valhalla",
        "season": "3",
        "series": "Vikings: Valhalla",
        "score": "",
        "synopsis": "The adventures of famous Vikings as they blaze new paths in an ever-changing Europe.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 1 – Mastermind: To Think Like a Killer",
        "season": "1",
        "series": "Mastermind: To Think Like a Killer",
        "score": "",
        "synopsis": "A new perspective on the woman whose crime-hunting innovations changed history; to stop serial killers, Dr. Ann Burgess must first learn to think like one; Burgess investigates and studies the damaged psyches of victims and their attackers.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 2 – The Serpent Queen",
        "season": "2",
        "series": "The Serpent Queen",
        "score": "",
        "synopsis": "\"The Serpent Queen\" is a cunning account of one of the most influential women ever to wear a crown: Catherine de' Medici. Considered an immigrant, common and plain, de' Medici marries into the 16th century French court as an orphanedteenager, expected to bring a fortune in dowry and produce many heirs. She quickly discovers that her husband is in love with an older woman, her dowry is unpaid, and she is unable to conceive. Yet, with only her intelligence and determination, she manages to keep her marriage alive and masters the bloodsport that is the monarchy better than anyone else, ruling France for 50 years.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 1 – Me",
        "season": "1",
        "series": "Me",
        "score": "",
        "synopsis": "New school, new family, new superpower; a season of change for 12-year-old Ben Vasani when he discovers that he can transform into anyone he meets; as a shapeshifter, Ben must figure out who he is and who he wants to be.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 21 – The Bachelorette",
        "season": "21",
        "series": "The Bachelorette",
        "score": "",
        "synopsis": "A woman meets a number of men and tries to narrow them down to one who could steal her heart.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 3 – All American: Homecoming",
        "season": "3",
        "series": "All American: Homecoming",
        "score": "",
        "synopsis": "A young adult sports drama set against the backdrop of the HBCU, aka historically Black colleges and universities, experience at Bringston University, where Black excellence is a way of life. The series follows Simone, a young tennis hopeful from Beverly Hills who is trying to fight her way back after some time away from the court; Damon, an elite baseball player from Chicago who is carrying the weight of the world on his shoulders; JR, Damon's fellow baseball player and childhood friend; Thea, the super-competitive queen bee of the Bringston tennis team; and Keisha, the school's unofficial mayor who must help Simone learn how to live her best life. As they contend with the high stakes of college sports, Simone and Damon must also navigate the highs and lows of unsupervised early adulthood at a prestigious HBCU.\n            \nRead More\nRead Less"
    },
    {
        "title": "The Bikeriders",
        "season": null,
        "series": null,
        "score": "81%",
        "synopsis": "THE BIKERIDERS captures a rebellious time in America when the culture and people were changing. After a chance encounter at a local bar, strong-willed Kathy (Jodie Comer) is inextricably drawn to Benny (Austin Butler), the newest member of Midwestern motorcycle club, the Vandals led by the enigmatic Johnny (Tom Hardy). Much like the country around it, the club begins to evolve, transforming from a gathering place for local outsiders into a dangerous underworld of violence, forcing Benny to choose between Kathy and his loyalty to the club.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 1 – Star Wars: The Acolyte",
        "season": "1",
        "series": "Star Wars: The Acolyte",
        "score": "80%",
        "synopsis": "A former Padawan reunites with her Jedi Master to investigate a series of crimes but discovers the forces they confront are more sinister than they ever anticipated.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 3 – All American: Homecoming",
        "season": "3",
        "series": "All American: Homecoming",
        "score": "",
        "synopsis": "A young adult sports drama set against the backdrop of the HBCU, aka historically Black colleges and universities, experience at Bringston University, where Black excellence is a way of life. The series follows Simone, a young tennis hopeful from Beverly Hills who is trying to fight her way back after some time away from the court; Damon, an elite baseball player from Chicago who is carrying the weight of the world on his shoulders; JR, Damon's fellow baseball player and childhood friend; Thea, the super-competitive queen bee of the Bringston tennis team; and Keisha, the school's unofficial mayor who must help Simone learn how to live her best life. As they contend with the high stakes of college sports, Simone and Damon must also navigate the highs and lows of unsupervised early adulthood at a prestigious HBCU.\n            \nRead More\nRead Less"
    },
    {
        "title": "Season 3 – All American: Homecoming",
        "season": "3",
        "series": "All American: Homecoming",
        "score": "",
        "synopsis": "A young adult sports drama set against the backdrop of the HBCU, aka historically Black colleges and universities, experience at Bringston University, where Black excellence is a way of life. The series follows Simone, a young tennis hopeful from Beverly Hills who is trying to fight her way back after some time away from the court; Damon, an elite baseball player from Chicago who is carrying the weight of the world on his shoulders; JR, Damon's fellow baseball player and childhood friend; Thea, the super-competitive queen bee of the Bringston tennis team; and Keisha, the school's unofficial mayor who must help Simone learn how to live her best life. As they contend with the high stakes of college sports, Simone and Damon must also navigate the highs and lows of unsupervised early adulthood at a prestigious HBCU.\n            \nRead More\nRead Less"
    },
    {
        "title": "Longlegs",
        "season": null,
        "series": null,
        "score": "86%",
        "synopsis": "In pursuit of a serial killer, an FBI agent uncovers a series of occult clues that she must solve to end his terrifying killing spree.\n            \nRead More\nRead Less"
    },
    {
        "title": "The Outwaters",
        "season": null,
        "series": null,
        "score": "75%",
        "synopsis": "Four travelers experience a mind-bending trip through terror while camping in a remote stretch of the Mojave desert.\n            \nRead More\nRead Less"
    },
    {
        "title": "The Outwaters",
        "season": null,
        "series": null,
        "score": "75%",
        "synopsis": "Four travelers experience a mind-bending trip through terror while camping in a remote stretch of the Mojave desert.\n            \nRead More\nRead Less"
    },
    {
        "title": "The Nature of Love",
        "season": null,
        "series": null,
        "score": "93%",
        "synopsis": "Sophia, a 40-year-old philosophy professor, has been in a stable and conventional marriage to Xavier for a decade. From gallery openings to endless dinner parties, ten years have flown by. When Sophia meets Sylvain, a craftsman renovating the couple's new country house, Sophia's world is turned upside down. The two begin a passionate affair fueled by their irresistible physical connection. However, Sophia comes from a wealthy family of intellectuals, while Sylvain comes from a working-class family of manual workers. As they get to know each other on a deeper level, Sophia begins to question her own values after abandoning herself to her great romantic impulses. Director Monia Chokri delivers a smart and sexy romantic comedy, infusing it with spiky energy and fresh perspective, upending genre and gender conventions.\n            \nRead More\nRead Less"
    },
    {
        "title": "Protocol 7",
        "season": null,
        "series": null,
        "score": "40%",
        "synopsis": "Based on real-life events, comes the corporate thriller, Protocol 7. Alexis Koprowski, a devoted mother and small-town family lawyer, Adrian Jay, a renegade doctor exiled from the medical profession, and Steve Schilling, a virologist at a prominent vaccine laboratory turned corporate whistleblower, work together to hold a large pharmaceutical corporation accountable for allegedly fraudulent test results behind a failing mumps vaccine. Protocol 7 takes us behind the corporate curtain, exposing a chain of command that devolves responsibility, prioritizes profits over people, and fosters an amoral mindset of \"just following orders.\"\n            \nRead More\nRead Less"
    },
    {
        "title": "Kill",
        "season": null,
        "series": null,
        "score": "90%",
        "synopsis": "When army commando Amrit (Lakshya) finds out his true love Tulika (Tanya Maniktala) is engaged against her will, he boards a New Delhi-bound train in a daring quest to derail the arranged marriage. But when a gang of knife-wielding thieves led by the ruthless Fani (Raghav Juyal) begin to terrorize innocent passengers on his train, Amrit takes them on himself in a death-defying kill-spree to save those around him -- turning what should have been a typical commute into an adrenaline-fueled thrill ride.\n            \nRead More\nRead Less"
    }
]