[
    {
        "series": "Sunny",
        "seasons": [
            "1"
        ],
        "movies": []
    },
    {
        "series": "Sausage Party: Foodtopia",
        "seasons": [
            "1"
        ],
        "movies": []
    },
    {
        "series": "Vikings: Valhalla",
        "seasons": [
            "3"
        ],
        "movies": []
    },
    {
        "series": "Mastermind: To Think Like a Killer",
        "seasons": [
            "1"
        ],
        "movies": []
    },
    {
        "series": "The Serpent Queen",
        "seasons": [
            "2"
        ],
        "movies": []
    },
    {
        "series": "Me",
        "seasons": [
            "1"
        ],
        "movies": []
    },
    {
        "series": "The Bachelorette",
        "seasons": [
            "21"
        ],
        "movies": []
    },
    {
        "series": "All American: Homecoming",
        "seasons": [
            "3"
        ],
        "movies": []
    },
    {
        "series": "The Bikeriders",
        "seasons": "N/A",
        "movies": [
            {
                "title": "The Bikeriders",
                "score": "81%",
                "synopsis": "THE BIKERIDERS captures a rebellious time in America when the culture and people were changing. After a chance encounter at a local bar, strong-willed Kathy (Jodie Comer) is inextricably drawn to Benny (Austin Butler), the newest member of Midwestern motorcycle club, the Vandals led by the enigmatic Johnny (Tom Hardy). Much like the country around it, the club begins to evolve, transforming from a gathering place for local outsiders into a dangerous underworld of violence, forcing Benny to choose between Kathy and his loyalty to the club.\n            \nRead More\nRead Less"
            }
        ]
    },
    {
        "series": "Star Wars: The Acolyte",
        "seasons": [
            "1"
        ],
        "movies": []
    },
    {
        "series": "Longlegs",
        "seasons": "N/A",
        "movies": [
            {
                "title": "Longlegs",
                "score": "86%",
                "synopsis": "In pursuit of a serial killer, an FBI agent uncovers a series of occult clues that she must solve to end his terrifying killing spree.\n            \nRead More\nRead Less"
            }
        ]
    },
    {
        "series": "The Outwaters",
        "seasons": "N/A",
        "movies": [
            {
                "title": "The Outwaters",
                "score": "75%",
                "synopsis": "Four travelers experience a mind-bending trip through terror while camping in a remote stretch of the Mojave desert.\n            \nRead More\nRead Less"
            },
            {
                "title": "The Outwaters",
                "score": "75%",
                "synopsis": "Four travelers experience a mind-bending trip through terror while camping in a remote stretch of the Mojave desert.\n            \nRead More\nRead Less"
            }
        ]
    },
    {
        "series": "The Nature of Love",
        "seasons": "N/A",
        "movies": [
            {
                "title": "The Nature of Love",
                "score": "93%",
                "synopsis": "Sophia, a 40-year-old philosophy professor, has been in a stable and conventional marriage to Xavier for a decade. From gallery openings to endless dinner parties, ten years have flown by. When Sophia meets Sylvain, a craftsman renovating the couple's new country house, Sophia's world is turned upside down. The two begin a passionate affair fueled by their irresistible physical connection. However, Sophia comes from a wealthy family of intellectuals, while Sylvain comes from a working-class family of manual workers. As they get to know each other on a deeper level, Sophia begins to question her own values after abandoning herself to her great romantic impulses. Director Monia Chokri delivers a smart and sexy romantic comedy, infusing it with spiky energy and fresh perspective, upending genre and gender conventions.\n            \nRead More\nRead Less"
            }
        ]
    },
    {
        "series": "Protocol 7",
        "seasons": "N/A",
        "movies": [
            {
                "title": "Protocol 7",
                "score": "40%",
                "synopsis": "Based on real-life events, comes the corporate thriller, Protocol 7. Alexis Koprowski, a devoted mother and small-town family lawyer, Adrian Jay, a renegade doctor exiled from the medical profession, and Steve Schilling, a virologist at a prominent vaccine laboratory turned corporate whistleblower, work together to hold a large pharmaceutical corporation accountable for allegedly fraudulent test results behind a failing mumps vaccine. Protocol 7 takes us behind the corporate curtain, exposing a chain of command that devolves responsibility, prioritizes profits over people, and fosters an amoral mindset of \"just following orders.\"\n            \nRead More\nRead Less"
            }
        ]
    },
    {
        "series": "Kill",
        "seasons": "N/A",
        "movies": [
            {
                "title": "Kill",
                "score": "90%",
                "synopsis": "When army commando Amrit (Lakshya) finds out his true love Tulika (Tanya Maniktala) is engaged against her will, he boards a New Delhi-bound train in a daring quest to derail the arranged marriage. But when a gang of knife-wielding thieves led by the ruthless Fani (Raghav Juyal) begin to terrorize innocent passengers on his train, Amrit takes them on himself in a death-defying kill-spree to save those around him -- turning what should have been a typical commute into an adrenaline-fueled thrill ride.\n            \nRead More\nRead Less"
            }
        ]
    }
]